docs: replace ascci diagrams with mermaid
